import 'package:counter/Components/Divider.dart';
import 'package:counter/Components/Text.dart';
import 'package:counter/Vars.dart';
import 'package:flutter/material.dart';

class Masjid extends StatefulWidget {
  const Masjid({Key? key}) : super(key: key);

  @override
  State<Masjid> createState() => _MasjidState();
}

class _MasjidState extends State<Masjid> {
  @override
  Widget build(BuildContext context) {
    return MaterialApp(
      title: app_title,
      home: Scaffold(
        backgroundColor: backColor,
        body: SafeArea(
            child: SingleChildScrollView(
          child: Column(
            crossAxisAlignment: CrossAxisAlignment.end,
            children: [
              Center(
                child: Column(
                  children: [
                    titleText(
                      context,
                      "أدعية المسجد",
                    ),
                    normalText(
                      context,
                      "عند الذهاب (اللَّهُمَّ اجْعَلْ فِي قَلْبِي نُوراً، وَفِي لِسَانِي نُوراً، وَفِي سَمْعِي نُوراً، وَفِي بَصَرِي نُوراً، وَمِنْ فَوْقِي نُوراً، وَمِنْ تَحْتِي نُوراً، وَعَنْ يَمِينِي نُوراً، وَعَنْ شِمَالِي نُوراً، وَمِنْ أَمَامِي نُوراً، وَمِنْ خَلْفِي نُوراً، وَاجْعَلْ فِي نَفْسِي نُوراً، وَأَعْظِمْ لِي نُوراً، وَعَظِّم لِي نُوراً، وَاجْعَلْ لِي نُوراً، وَاجْعَلْنِي نُوراً، اللَّهُمَّ أَعْطِنِي نُوراً، وَاجْعَلْ فِي عَصَبِي نُوراً، وَفِي لَحْمِي نُوراً، وَفِي دَمِي نُوراً، وَفِي شَعْرِي نُوراً، وَفِي بَشَرِي نُوراً)] ",
                    ),
                    divider(context),
                    note(context, "(1)"),
                    normalText(context,
                        "([اللَّهُمَّ اجْعَلْ لِي نُوراً فِي قَبْرِي... وَنُوراً فِي عِظَامِي])"),
                    note(context, "(2)"),
                    divider(context),
                    normalText(context,
                        "[(وَزِدْنِي نُوراً، وَزِدْنِي نُوراً، وَزِدْنِي نُوراً)]"),
                    note(context, "(3)"),
                    divider(context),
                    normalText(context, "[(وَهَبْ لِي نُوراً عَلَى نُورٍ)]"),
                    note(context, "(4)"),
                    divider(context),
                    normalText(
                      context,
                      "(عند الدخول يَبْدَأُ بِرِجْلِهِ الْيُمْنَى) ، وَيَقُولُ: ((أَعُوذُ بِاللَّهِ العَظِيمِ، وَبِوَجْهِهِ الْكَرِيمِ، وَسُلْطَانِهِ الْقَدِيمِ، مِنَ الشَّيْطَانِ الرَّجِيمِ)) [بِسْمِ اللَّهِ، وَالصَّلَاةُ] [وَالسَّلَامُ عَلَى رَسُولِ اللَّهِ] ((اللَّهُمَّ افْتَحْ لِي أَبْوَابَ رَحْمَتِكَ)).",
                    ),
                    note(context, "(5),(6),(7),(8),(9)"),
                    divider(context),
                    normalText(
                      context,
                      "((عند الخروج يَبْدَأُ بِرِجْلِهِ الْيُسْرَى)) وَيَقُولُ: ((بِسْمِ اللَّهِ وَالصّلَاةُ وَالسَّلَامُ عَلَى رَسُولِ اللَّهِ، اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِك، اللَّهُمَّ اعْصِمْنِي مِنَ الشَّيْطَانِ الرَّجِيمِ)).",
                    ),
                    note(context, "(10),(11)")
                  ],
                ),
              ),
              divider(context),
              note(context,
                  "(1)  انظر جميع هذه الألفاظ في البخاري، 11/ 116، برقم 6316، ومسلم، 1/ 526، و529، و530، برقم 763 ."),
              note(context, "(2)  الترمذي، 5/ 483، برقم 3419 ."),
              note(context,
                  "(3)  أخرجه البخاري في الأدب المفرد، برقم 695، ص258 وصحح إسناده الألباني في صحيح الأدب المفرد، برقم 536 ."),
              note(context,
                  "(4)  ذكره ابن حجر في فتح الباري، وعزاه إلى ابن أبي عاصم في كتاب الدعاء، انظر الفتح 11/118، وقال: فاجتمع من اختلاف الروايات خمس وعشرون خصلة."),
              note(context,
                  "(5) لقول أنس بن مالك : ((من السنة إذ دخلت المسجد أن تَبدأ برجلك اليمنى، وإذا خرجت أن تبدأ برجلك اليسرى))، أخرجه الحاكم، 1/ 218، وصححه على شرط مسلم، ووافقه الذهبي، وأخرجه البيهقي، 2/ 442، وحسنه الألباني في سلسلة الأحاديث الصحيحة، 5/ 624، برقم 2478."),
              note(context,
                  "(6)  أبو داود، برقم 466، وانظر: صحيح الجامع، برقم 4591 ."),
              note(context,
                  "(7)  رواه ابن السني، برقم 88، وحسنه الألباني في الثمر المستطاب، ص 607."),
              note(context,
                  "(8)  أبو داود، 1/ 126، برقم 465، وانظر: صحيح الجامع، 1/528 ."),
              note(context,
                  "(9)  مسلم، 1/ 494، برقم 713، وفي سنن ابن ماجه من حديث فاطمة ’:((اللهم اغفر لي ذنوبي،وافتح لي أبواب رحمتك))، وصححه الألباني لشواهده. انظر: صحيح ابن ماجه، 1/128-129."),
              note(context,
                  "(10) الحاكم، 1/ 218، والبيهقي، 2/ 442، وحسنه الألباني في سلسلة الأحاديث الصحيحة، 5/ 624، برقم 2478، وتقدم تخريجه."),
              note(context,
                  "(11) انظر تخريج روايات الحديث السابق في دعاء دخول المسجد، رقم(20) وزيادة: ((اللهم اعصمني من الشيطان الرجيم)) لابن ماجه. انظر: صحيح ابن ماجه، 1/129 ."),
            ],
          ),
        )),
      ),
      debugShowCheckedModeBanner: false,
    );
  }
}
